Revit 2026 API

# ForgeTypeId Class

---

This class holds a string that uniquely identifies a Forge schema.

SystemObject Autodesk.Revit.DBForgeTypeId

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ForgeTypeId : IDisposable
```
```vb
Public Class ForgeTypeId
	Implements IDisposable
```
```cpp
public ref class ForgeTypeId : IDisposable
```
```fsharp
type ForgeTypeId =
    class
        interface IDisposable
    end
```

The ForgeTypeId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ForgeTypeId | Constructs a ForgeTypeId holding an empty schema identifier. |
|  | ForgeTypeId(String) | Constructs a ForgeTypeId holding the given schema identifier. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | TypeId | The schema identifier. |

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Sets the typeId to an empty string |
|  | Dispose | Releases all resources used by the ForgeTypeId |
|  | Empty | Checks if the typeId is an empty string |
|  | Equals | Determines whether this ForgeTypeId is equal to another. (Overrides ObjectEquals(Object)) |
|  | GetHashCode | Returns the hash code for this ForgeTypeId (Overrides ObjectGetHashCode) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | NameEquals | Returns true if the typeid string held by this ForgeTypeId is equal to that held by the given ForgeTypeId, excluding the version number. The version number of a typeid string follows a hyphen character. This function compares the typeid strings up to the first hyphen. This is the default equality comparison method for the ForgeTypeId class, used by the equality operator (==). |
|  | StrictlyEquals | Returns true if the entire typeid string held by this ForgeTypeId is exactly equal to that held by the given ForgeTypeId. For the default equality comparison used by the equality operator (==), see NameEquals(ForgeTypeId). |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

|  | Name | Description |
| --- | --- | --- |
|  | Equality(ForgeTypeId, ForgeTypeId) |  |
|  | Inequality(ForgeTypeId, ForgeTypeId) |  |
|  | LessThan(ForgeTypeId, ForgeTypeId) |  |

#### Reference

Autodesk.Revit.DB Namespace